# Core Shell & Editor
brew "zsh"
brew "neovim"

# Terminal Navigation & Search
brew "zoxide"

# Version & Environment Management
brew "asdf"
brew "direnv"

# Infrastructure
brew "terraform"

# AI Tooling
brew "gemini-cli"

# Cloud SDKs
brew "awscli"
cask "google-cloud-sdk"

# Architecture & Diagrams
brew "mermaid-cli"

# Build Dependencies (for ASDF Python/Node)
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
